data/Parm_PH_29/alpha_05/alpha_05_7071_4048/0/tauij_LES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      tauij_LES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor>
15600
(
(0.00631184 -0.00013630 0.00000000 0.00006484 0.00000000 0.00442667)
(0.00035466 -0.00005348 0.00000000 0.00000986 0.00000000 0.00016508)
(0.00003865 0.00000070 0.00000000 -0.00005441 0.00000000 0.00000793)
(0.00005081 0.00000815 0.00000000 -0.00006323 0.00000000 0.00013019)
(0.00000499 -0.00001041 0.00000000 0.00001678 0.00000000 0.00016272)
(0.00000115 -0.00000405 0.00000000 0.00000809 0.00000000 0.00024350)
(-0.00000884 0.00001040 0.00000000 -0.00000498 0.00000000 0.00023653)
(-0.00000458 0.00000404 0.00000000 0.00000263 0.00000000 0.00025549)
...
)
;

boundaryField
{
    bottomWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    topWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    inlet_half0
    {
        type        cyclic;
    }
    inlet_half1
    {
        type        cyclic;
    }
    outlet_half0
    {
        type        cyclic;
    }
    outlet_half1
    {
        type        cyclic;
    }
    sideRight_half0
    {
        type        empty;
    }
    sideRight_half1
    {
        type        empty;
    }
    sideLeft_half0
    {
        type        empty;
    }
    sideLeft_half1
    {
        type        empty;
    }
}

// ************************************************************************* //
